clc,clear,close all
format long
M=0.5;    % 小车质量
m=0.5;    % 摆杆质量
b=0.1;    % 小车摩擦系数
I=0.006;  % 摆杆惯量
l=0.3;    % 摆杆转动轴心到杆质心的长度
g=9.8;    % 重力加速度
A=[  0 ,     1,                 0                 0;
     0,      0,   m^2*l^2*g/((M+m)*I+M*m*l^2),    0;
     0,      0,                 0,                1;
     0,      0,   (M+m)*m*g*l/((M+m)*I+M*m*l^2),  0];
B=[0;  (I+m*l^2)/((M+m)*I+M*m*l^2);  0;  m*l/(((M+m)*I+M*m*l^2))];
C=[1 0 0 0;0 1 0 0;0 0 1 0;0 0 0 1];
D=[0;0;0;0];
p=[-10,-7,-1.901,-1.9];
K=place(A,B,p);
